In [1]:
#Series data defines a single columns-each column in a dataframe is a series
import pandas as pd

In [2]:
#create a dataframe-using a dictionary
data={
    "Name":["Peter","Jane","Kim"],
    "Age":[22,45,58],
    "Sex":["Male","Female","Male"]
}
#Name, Age and Sex are dictionary keys denoting column headers
#values in each list denotes column values

In [4]:
data

{'Name': ['Peter', 'Jane', 'Kim'],
 'Age': [22, 45, 58],
 'Sex': ['Male', 'Female', 'Male']}

In [13]:
df=pd.DataFrame(data)

In [14]:
df

    Name  Age     Sex
0  Peter   22    Male
1   Jane   45  Female
2    Kim   58    Male

In [15]:
#Add another column called marks in the dataframe
df["Marks"]=pd.Series([78,45,90])

In [16]:
df

    Name  Age     Sex  Marks
0  Peter   22    Male     78
1   Jane   45  Female     45
2    Kim   58    Male     90

In [17]:
#sort by marks in descending order
df.sort_values(by="Marks", ascending=False)

    Name  Age     Sex  Marks
2    Kim   58    Male     90
0  Peter   22    Male     78
1   Jane   45  Female     45